server/app/controllers/users/sessions_controller.rb

  def create
    resource = User.find_for_database_authentication(email: params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'nate@fullstack.io' ORDER BY "users"."id" ASC LIMIT 1