server/app/controllers/contacts_controller.rb

    def create
		@contact = Contact.new(@contact_params);
		if @contact.save
---
INSERT INTO "contacts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-12-17 20:33:56.330580"], ["updated_at", "2014-12-17 20:33:56.330580"]]