app/controllers/admin_controller.rb

    def index
        render :status => 200,
               :json => { :success => true, :info => "", :data => User.all }
---
SELECT "users".* FROM "users"