app/controllers/registration_controller.rb

    def create
        user = User.new(user_params)
        user.roles = if params[:user][:admin] == true then [:admin] else [:user] end

        if user.save
---
INSERT INTO "users" ("created_at", "email", "encrypted_password", "roles_mask", "updated_at") VALUES (?, ?, ?, ?, ?)